Pandas - Panel Data

In [1]:
import pandas as pd
ll = pd.DataFrame({
    'Marks' : [90,50, 30],
    'Grade' : ['A', 'B', 'C']
})
print(ll)

   Marks Grade
0     90     A
1     50     B
2     30     C

# Pandas

In [12]:
import pandas as pd
ll = pd.DataFrame({
    'Marks' : [90,50, 30],
    'Grade' : ['A', 'B', 'C']},
    index = ['Parth', 'Sage', 'Raze']
)
ll

       Marks Grade
Parth     90     A
Sage      50     B
Raze      30     C

In [ ]:
import pandas as pd
ingredients = pd.Series(['4 cups','1 cup','2 large','1 can'],index = ['Flour','Milk','Eggs','Spam'],name = "Dinner")

ingredients

Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
Name: Dinner, dtype: object

In [15]:
l2 = [
    ['Parth', 18, 5.5],
    ["sage", 19, 6.5],
    ["clove", 20, 7.5]
]
df = pd.DataFrame(l2, columns = ['Name', "Age", "Salary(lakhs)"])
df

    Name  Age  Salary(lakhs)
0  Parth   18            5.5
1   sage   19            6.5
2  clove   20            7.5

In [27]:
df['Age'] = [11,12,13]
df.drop(['Age'], axis=1, inplace=True) # Drop deletes, inplace is for
df

    Name  Salary(lakhs)
0  Parth            5.5
1   sage            6.5
2  clove            7.5

In [30]:
df.dropna(thresh = 1)

    Name  Salary(lakhs)
0  Parth            5.5
1   sage            6.5
2  clove            7.5